[
    {
	"image": "./img/OKState-Logo.png",
	"category": "Events",
	"title": "Human Factors and Ergonomics Society showcases versatility of human factors to OSU students",
	"source": "Oklahoma State University",
	"date": "June 10, 2025",
	"summary": "Oklahoma State University has established a chapter of the Human Factors and Ergonomics Society (HFES) within its College of Engineering, Architecture and Technology. The chapter aims to provide students with additional learning opportunities outside the classroom, support their academic performance, and prepare them for careers in human factors engineering. The organization is co-advised by Dr. Katie Jurewicz and Dr. Pratima Saravanan, with graduate research assistant Matt Nare serving as president. The chapter is affiliated with the national HFES, offering students access to a network of professionals and national conferences.",
	"link": "https://news.okstate.edu/articles/engineering-architecture-technology/2025/osu_starts_chapter_of_human_factors_and_ergonomics_society.html"
    },
	{
	"image": "./img/Discover_Eng-Logo.png",
	"category": "Research",
	"title": "Human Factors and Ergonomics in Industrial Engineering",
	"source": "Discover Engineering",
	"date": "June 10, 2025",
	"summary": "Human Factors and Ergonomics (HFE) is a critical discipline within Industrial Engineering that focuses on optimizing the interaction between humans and systems. This field aims to enhance productivity, safety, and comfort by designing systems that accommodate human capabilities and limitations. The importance of HFE in engineering cannot be overstated, as it directly impacts the efficiency and well-being of workers, the quality of products, and the overall performance of industrial operations. This article delves into the various aspects of Human Factors and Ergonomics in Industrial Engineering, exploring its fundamentals, historical development, applications, advanced topics, challenges, and considerations.",
	"link": "https://www.discoverengineering.org/human-factors-and-ergonomics-in-industrial-engineering/"
    },
	{
	"image": "./img/Macnifico-Logo.png",
	"category": "Industry",
	"title": "Exoskeleton Robotics for Occupational Safety Market 2025: Surge in Adoption Drives 18% CAGR Through 2029",
	"source": "Macnifico",
	"date": "June 9, 2025",
	"summary": "The global market for exoskeleton robotics in occupational safety is projected to grow at an 18% CAGR through 2029, driven by advancements in wearable robotics, increased workplace safety regulations, and rising awareness of occupational health. Companies like SuitX, Ottobock, and Honda Robotics are developing exoskeleton solutions to augment human strength, reduce fatigue, and minimize musculoskeletal injuries in sectors such as manufacturing, construction, and logistics. The integration of AI and IoT connectivity enables real-time monitoring of worker posture and fatigue, supporting proactive safety interventions.",
	"link": "https://www.macnifico.pt/news-en/exoskeleton-robotics-for-occupational-safety-market-2025-surge-in-adoption-drives-18-cagr-through-2029/96916/"
    },
	{
	"image": "./img/Noticias-Logo.png",
	"category": "Industry",
	"title": "Textile-Based Exoskeleton Technologies Market 2025: Smart Fabrics Drive 18% CAGR Amid Healthcare & Industrial Surge",
	"source": "Noticias",
	"date": "June 9, 2025",
	"summary": "Textile-based exoskeleton technologies are experiencing significant growth, with the market expected to expand at an 18% CAGR through 2029. Innovations in smart fabrics, such as conductive fibers and shape-memory polymers, are enhancing the comfort and functionality of wearable assistive devices. These advancements are particularly beneficial in healthcare and industrial applications, where they assist with mobility, reduce fatigue, and minimize the risk of musculoskeletal injuries. Companies like SuitX, Samsung, and Sarkari Exoskeleton are leading the development of these technologies.",
	"link": "https://lisboatv.pt/news_en/textile-based-exoskeleton-technologies-market-2025-smart-fabrics-drive-18-cagr-amid-healthcare-industrial-surge/59429/"
    },
	{
	"image": "./img/Canadian_OC_Safety-Logo.png",
	"category": "Legal",
	"title": "Safe by Design, Not by Chance",
	"source": "Canadian Occupational Safety",
	"date": "June 9, 2025",
	"summary": "Ontario's latest campaign, 'Safe by Design, Not by Chance,' empowers employers to eliminate avoidable risks at the source. The initiative focuses on redesigning systems and environments to prevent injuries, rather than relying solely on worker behavior. The campaign targets sectors with high rates of injuries, such as retail, warehousing, and manufacturing, emphasizing the importance of proactive safety measures and system-wide prevention strategies to reduce workplace hazards and protect workers.",
	"link": "https://www.thesafetymag.com/ca/topics/safety-and-ppe/safe-by-design-not-by-chance/538451"
    },
	{
	"image": "./img/Biznes_NewSeria-Logo.png",
	"category": "Industry",
	"title": "Sam Logistics Partners with Vestil Manufacturing to Enhance Warehouse Solutions",
	"source": "EIN Newswire - Newseria Biznes",
	"date": "June 9, 2025",
	"summary": "Sam Logistics & Supplies Inc. has partnered with Vestil Manufacturing to enhance warehouse solutions by integrating advanced material handling components. The collaboration aims to improve ergonomics and safety while streamlining operations in warehouses and distribution centers. The product lineup includes heavy-duty equipment like forklifts, pallet jacks, conveyors, and customizable storage solutions, all designed to boost warehouse capacity and ensure compliance with safety standards.",
	"link": "https://biznes.newseria.pl/ze-swiata/ein-newswire/sam-logistics-partners,b1440797450"
    },
	{
	"image": "./img/Philstar_Global-Logo.png",
	"category": "Industry",
	"title": "Innovators Champion Ergonomics for Sustainability",
	"source": "Philstar Global",
	"date": "June 8, 2025",
	"summary": "Innovators are championing ergonomics as a key factor in sustainability efforts, recognizing that well-designed work environments can lead to improved productivity, reduced waste, and enhanced worker well-being. By integrating ergonomic principles into product design and workplace layouts, companies are not only fostering a healthier workforce but also contributing to environmental sustainability. This approach aligns with global trends towards sustainable development and responsible business practices.",
	"link": "https://www.philstar.com/business/2025/06/08/2448855/innovators-champion-ergonomics-sustainability"
    },
	{
	"image": "./img/Interesting_Eng.png",
	"category": "Industry",
	"title": "Headless Humanoid Robot Built in 40 Days to Work in Renault Factory",
	"source": "Interesting Engineering",
	"date": "June 10, 2025",
	"summary": "Wandercraft has developed a headless humanoid robot named Calvin in just 40 days to perform manufacturing tasks at Renault's factory. The voice-controlled, self-balancing robot is designed to relieve workers from painful and non-ergonomic tasks, improving productivity and reducing physical strain. The collaboration between Wandercraft and Renault aims to integrate Calvin into industrial environments, enhancing worker safety and operational efficiency.",
	"link": "https://interestingengineering.com/innovation/calvin-humanoid-robot-work-at-renault"
    },
	{
	"image": "./img/ergonomics-research-tandfonline.png",
	"category": "Research",
	"title": "Learning to apply Design Thinking in participatory ergonomics: an exploratory study of OHS professionals in Denmark",
	"source": "Taylor & Francis Online",
	"date": "June 5, 2025",
	"summary": "This peer-reviewed study investigates the application of ergonomics in industrial settings, providing evidence-based strategies to mitigate musculoskeletal disorders through human-centered system design.",
	"link": "https://www.tandfonline.com/doi/full/10.1080/00140139.2025.2512427#abstract"
    },
	{
	"image": "./img/assp-logo.png",
	"category": "Events",
	"title": "2025 Society Elections Results",
	"source": "ASSP",
	"date": "June 5 2025",
	"summary": "ASSP’s 2025 elections are now open, allowing members to vote for board leadership. These positions shape safety strategy across industries, including advocacy for ergonomics and workplace health policy.",
	"link": "https://www.assp.org/membership/elections"
    },
	{
	"image": "./img/Transparent-AHFE-Logo.png",
	"category": "Events",
	"title": " 16th International Conference on Applied Human Factors and Ergonomics (AHFE 2025) and the Affiliated Conferences",
	"source": "AHFE",
	"date": "June 5 2025",
	"summary": "The AHFE 2025 conference features keynote speeches, technical sessions, workshops, and poster presentations. It covers topics in human factors, ergonomics, and system design, fostering collaboration between academia and industry professionals worldwide.",
	"link": "https://www.ahfe.org/program.html"
    },
	{
	"image": "./img/ohs-logo.png",
	"category": "Research",
	"title": "Ergonomic Research Highlights Role of Exoskeletons in Preventing Work Related Injuries",
	"source": "Occupational Health & Safety Online",
	"date": "June 3, 2025",
	"summary": "New ergonomic research highlights the effectiveness of exoskeletons in reducing work-related injuries. Studies show wearable devices can alleviate strain in physically demanding jobs, signaling a promising direction for workplace injury prevention technology.",
	"link": "https://ohsonline.com/articles/2025/06/03/ergonomic-research-highlights-role-of-exoskeletons-in-preventing-work-related-injuries.aspx"
    },
	{
	"image": "./img/exoskeleton-report-logo.png",
	"category": "Industry",
	"title": "Adopting Occupational Exoskeletons in Small, Medium and Large Businesses with Sarah Ballini-Ross, Ep 14",
	"source": "Exoskeleton Report",
	"date": "June 2, 2025",
	"summary": "Sarah Ballini Ross discusses exoskeleton adoption across businesses of all sizes. This episode highlights challenges, benefits, and practical strategies for integrating wearable robotics into workplace ergonomics.",
	"link": "https://exoskeletonreport.com/2025/06/adopting-occupational-exoskeletons-in-small-medium-and-large-businesses-with-sarah-ballini-ross-ep-14/"
    },
	{
	"image": "./img/ohs-logo.png",
	"category": "Events",
	"title": "ASSP Names Five Industry Leaders as 2025 Society Fellows",
	"source": "Occupational Health & Safety Online",
	"date": "June 2, 2025",
	"summary": "ASSP has named five professionals as 2025 Society Fellows for their outstanding contributions to the safety field. The announcement recognizes innovation, research, and leadership—including efforts to advance ergonomic safety and workplace health initiatives.",
	"link": "https://ohsonline.com/articles/2025/05/05/assp-names-five-industry-leaders-as-2025-society-fellows.aspx"
    },
	{
	"image": "./img/NewsCop.png",
	"category": "Research",
	"title": "Heads up … tech neck is becoming a major growing pain and a public health concern",
	"source": "NewsCop",
	"date": "May 31, 2025",
	"summary": "Tech neck, caused by prolonged device use with poor posture, is emerging as a public health issue. Experts warn of chronic pain, spinal degeneration, and long-term musculoskeletal problems if left unaddressed. The article urges increased awareness and proactive ergonomic habits in both work and daily life.",
	"link": "https://newscop.com.au/2025/05/31/heads-up-tech-neck-is-becoming-a-major-growing-pain-and-a-public-health-concern/"
    },
	{
	"image": "./img/Transparent-Fit_For_Work-Logo.png",
	"category": "Industry",
	"title": "Integrating Ergonomics with Continuous Improvement Initiatives: Considerations for the Human Operator",
	"source": "Fit For Work",
	"date": "May 30, 2025",
	"summary": "This article explores how integrating ergonomics with continuous improvement frameworks like Lean or Six Sigma can boost both worker well-being and process performance, emphasizing human-centered design.",
	"link": "https://wellworkforce.com/integrating-ergonomics-with-continuous-improvement-initiatives-considerations-for-the-human-operator/#"
    },
	{
	"image": "./img/SafetyCulture_Logo.png",
	"category": "Industry",
	"title": "5 Essential Ergonomic Practices for Manufacturing Teams",
	"source": "SafetyCulture",
	"date": "May 30, 2025",
	"summary": "Ergonomics in manufacturing is critical for injury prevention, worker satisfaction, and productivity. This guide outlines key ergonomic principles, risk factors in industrial settings, and best practices for implementation, such as workstation design, proper equipment use, and employee training.",
	"link": "https://safetyculture.com/topics/ergonomics-safety/ergonomics-in-manufacturing/"
    },
	{
	"image": "./img/RegionCanberra_Logo.png",
	"category": "Industry",
	"title": "Letting your employees work from home? Here's what you've signed up for",
	"source": "Region Canberra",
	"date": "May 30, 2025",
	"summary": "Remote work may boost flexibility, but employers must now address home office ergonomics, mental health, and compliance. Region outlines the unexpected obligations and liabilities that come with letting staff work from home, urging firms to adopt supportive, health-conscious policies.",
	"link": "https://region.com.au/letting-your-employees-work-from-home-heres-what-youve-signed-up-for/867951/"
    },
	{
	"image": "./img/DVIDS_Logo.png",
	"category": "Events",
	"title": "Oregon National Guard Ergonomics: ‘Keeping fit to fight’",
	"source": "DVIDS",
	"date": "May 30, 2025",
	"summary": "The Oregon National Guard is promoting ergonomic practices to keep soldiers physically prepared and injury-free. The initiative includes posture awareness, physical conditioning, and ergonomic training aimed at enhancing operational readiness and reducing musculoskeletal injuries.",
	"link": "https://www.dvidshub.net/news/499341/oregon-national-guard-ergonomics-keeping-fit-fight"
    },
	{
	"image": "./img/ANSSI_Wellness_Logo.png",
	"category": "Research",
	"title": "Workplace Ergonomics and Orthopaedic Health: How to Avoid Work-Related Musculoskeletal Issues",
	"source": "ANSSI Wellness",
	"date": "May 29, 2025",
	"summary": "Workplace ergonomics plays a vital role in preventing orthopedic issues like back pain and carpal tunnel syndrome. ANSSI Wellness emphasizes the importance of ergonomic workspaces, movement, and posture awareness to reduce musculoskeletal stress and improve long-term employee well-being.",
	"link": "https://www.anssiwellness.com/workplace-ergonomics-and-orthopaedic-health-how-to-avoid-work-related-musculoskeletal-issues/"
    },
	{
	"image": "./img/Ergonomics_Center_Logo.png",
	"category": "Industry",
	"title": "Ergonomics Solutions Webinar: Casters",
	"source": "YouTube",
	"date": "May 29, 2025",
	"summary": "This video explains ergonomic best practices for computer users, focusing on posture, desk setup, and movement. It offers accessible tips to reduce strain and discomfort during long hours of desk work, suitable for office and remote workers alike.",
	"link": "https://www.youtube.com/watch?v=QQweCJiIPmg"
    },
	{
	"image": "./img/Native_News_Online_Logo.png",
	"category": "Legal",
	"title": "How OSHA 10-Hour Online Course Training Meets Federal and State Regulations",
	"source": "Native News Online",
	"date": "May 29, 2025",
	"summary": "The OSHA 10-Hour Online Course helps workers meet federal and state safety training regulations. This article explains how the course covers essential topics including ergonomics, hazard recognition, and worker rights, and is accepted across various industries.",
	"link": "https://nativenewsonline.net/advertise/branded-voices/how-osha-10-hour-online-course-training-meets-federal-and-state-regulations"
    },

	{
	"image": "./img/designwanted_logo.png",
	"category": "Industry",
	"title": "Empowering people living with Parkinson through an inclusive and accessible keyboard",
	"source": "DesignWanted",
	"date": "May 29, 2025",
	"summary": "Designer Alessandra Galli has developed OnCUE, a wearable device aimed at improving mobility for individuals with Parkinson’s disease. Combining ergonomic design and auditory cues, OnCUE helps reduce freezing of gait episodes, offering a user-centered solution that enhances independence and quality of life.",
	"link": "https://designwanted.com/oncue-parkinson-alessandra-galli/"
    },

	{
	"image": "./img/ohs-logo.png",
	"category": "Industry",
	"title": "German Bionic Unveils EXIA: The First Augmented AI-Powered Exoskeleton",
	"source": "Occupational Health & Safety (OH&S)",
	"date": "May 29, 2025",
	"summary": "German Bionic has launched EXIA, the world’s first AI-powered ergonomic exoskeleton designed to support lifting tasks in logistics and manufacturing. EXIA adapts in real time to user movements and tasks, reducing strain and injury risk. This marks a major advancement in workplace wearable robotics.",
	"link": "https://ohsonline.com/articles/2025/05/28/german-bionic-unveils-exia-the-first-augmented-ai-powered-exoskeleton.aspx?admgarea=ht.Ergonomics"
    },

	{
	"image": "./img/APN_Logo.png",
	"category": "Industry",
	"title": "Shifting Work Patterns Demand Smarter Ergonomic Solutions, Says Dr. Alan Hedge, the World-Renowned Ergonomist",
	"source": "APN News",
	"date": "May 29, 2025",
	"summary": "Dr. Alan Hedge emphasizes the urgent need for adaptive ergonomic solutions amid evolving work environments, including hybrid and remote setups. He advocates for proactive design that supports well-being, productivity, and long-term health, highlighting how modern ergonomics must align with flexible work patterns.",
	"link": "https://www.apnnews.com/shifting-work-patterns-demand-smarter-ergonomic-solutions-says-dr-alan-hedge-the-world-renowned-ergonomist/"
    },
	{
	"image": "./img/assp-logo.png",
	"category": "Events",
	"title": "Safety 2025 in Orlando Will Feature Can’t-Miss Expo",
	"source": "ASSP",
	"date": "May 28, 2025",
	"summary": "ASSP’s Safety 2025 event in Orlando promises a major expo showcasing safety innovations, networking opportunities, and professional development. Attendees can expect leading ergonomics and safety solutions on display.",
	"link": "https://www.assp.org/news-and-articles/safety-2025-in-orlando-will-feature-can-t-miss-expo"
    },
	{
	"image": "./img/Frontiers.png",
	"category": "Research",
	"title": "Global burden of occupational ergonomic factor-induced low back pain, 1990~2021: data analysis and projections of the global burden of disease",
	"source": "Frontiers in Public Health",
	"date": "May 28, 2025",
	"summary": "This systematic review examines ergonomic interventions in diverse workplace settings and their impact on public health outcomes. The study identifies consistent improvements in musculoskeletal health, worker productivity, and injury reduction, emphasizing the role of ergonomics in occupational health strategies.",
	"link": "https://www.frontiersin.org/journals/public-health/articles/10.3389/fpubh.2025.1573828/full"
    },

	{
  	"image": "./img/auburn-ose-logo.png",
  	"category": "Events",
  	"title": "ISE doctoral student recognized as Ergonomic Practitioner of the Year",
  	"source": "Auburn University",
  	"date": "May 23, 2025",
  	"summary": "Auburn University PhD student Francisco Maldonado has won the IISE Practitioner Doctoral Research Award for his innovative work in industrial and systems engineering. His research focuses on enhancing operational efficiency in complex systems and has direct applications in industry, showcasing the practical impact of academic scholarship.",
  	"link": "https://eng.auburn.edu/news/2025/05/ise-doctoral-practitioner-award"
    },
	{
  	"image": "./img/osh_Canadian.png",
  	"category": "Industry",
  	"title": "The Missing Link in Warehouse Safety",
  	"source": "Occupational Health & Safety Canada",
  	"date": "May 23, 2025",
  	"summary": "This opinion piece from OHS Canada emphasizes the often-overlooked ergonomic risks in warehouse environments. It argues that while safety programs focus heavily on equipment and procedures, they frequently neglect musculoskeletal health. The article advocates for integrating ergonomics into safety planning and worker training to reduce injuries and improve productivity.",
  	"link": "https://www.ohscanada.com/opinions/the-missing-link-in-warehouse-safety/"
    },
	{
  	"image": "./img/hfes-logo.png",
 	"category": "Research",
  	"title": "Open Call for Proposal Reviewers for HFES Seed Grants Targeting the Intersections of HFE and Anti-Racism/Anti-Bias",
  	"source": "Human Factors and Ergonomics Society",
  	"date": "May 21, 2025",
  	"summary": "HFES is seeking reviewers for its seed grant program focused on projects at the intersection of human factors/ergonomics and anti-racism/anti-bias. Selected reviewers will assess proposals for their scientific merit and societal impact. This initiative aims to promote inclusive research and foster diversity within the HFE community.",
  	"link": "https://www.hfes.org/About/Latest-News/open-call-for-proposal-reviewers-for-hfes-seed-grants-targeting-the-intersections-of-hfe-and-anti-racismanti-bias-1"   
    },
	{
        "image": "img/hfes-logo.png",
        "category": "Events",
        "title": "ASPIRE International Annual Meeting",
        "source": "Human Factors and Ergonomics Society",
        "date": "May 21, 2025",
        "summary": "The 2025 ASPIRE HFES International Annual Meeting will be held October 13–17 in Indianapolis, Indiana. This newly rebranded conference (formerly the HFES Annual Meeting) emphasizes Accessibility, Sustainability, Participation, Inclusivity, Resilience, and Equity. It will showcase innovative human factors and ergonomics research, promote global collaboration, and feature technical sessions, workshops, networking, and student opportunities. The event aims to foster meaningful, cross-disciplinary discussions and solutions to real-world challenges.",
	"link": "https://www.hfes.org/Events/ASPIRE-International-Annual-Meeting/About-the-2025-Meeting/About-the-2025-Meeting-"
    },
	{
        "image": "./img/modern-materials-handling-logo.png",
        "category": "Industry",
        "title": "Making a business case for warehouse ergonomics",
        "source": "ModernMaterials Handling",
        "date": "May 21, 2025",
        "summary": "Investing in warehouse ergonomics enhances worker safety, efficiency, and morale while reducing injury-related costs. Poor ergonomics often leads to musculoskeletal disorders (MSDs), which are common in physically demanding warehouse environments. Implementing ergonomic solutions—such as adjustable workstations, lift-assist devices, and automation—can significantly lower physical strain. Research shows these interventions reduce workers’ compensation costs by up to 68% and claims by 39%. Additionally, improved ergonomics can increase productivity by 25% and reduce employee turnover by 48%. A strong ergonomic strategy supports long-term operational success, demonstrating that health-focused design is not just ethical—it’s also economically smart.",
	"link": "https://www.mmh.com/article/making_a_business_case_for_warehouse_ergonomics/ergonomics"
    },
    	{
        "image": "./img/osha-logo.png",
        "category": "Legal",
        "title": "Long Work Hours, Extended or Irregular Shifts, and worker Fatigue",
        "source": "Osha",
        "date": "May 20, 2025",
        "summary":"The U.S. Occupational Safety and Health Administration (OSHA) highlights the significant risks associated with worker fatigue due to extended or irregular shifts. Fatigue can lead to decreased alertness, impaired decision-making, and increased risk of accidents. Industries such as healthcare, transportation, and manufacturing are particularly affected. OSHA recommends strategies like limiting shift lengths, ensuring adequate rest periods, and providing training to mitigate fatigue-related hazards. Employers are encouraged to recognize fatigue symptoms and implement preventive measures to safeguard worker health and safety.",
        "link": "https://www.osha.gov/worker-fatigue"
    },
	{
        "image": "./img/Puget_Sound_Chapter_HFES.png",
        "category": "Events",
        "title": "24th Annual Human Factors and Ergonomics Symposium",
        "source": "The Puget Sound Chapter of the Human Factors and Ergonomics Society",
        "date": "April, 2025",
        "summary":"The 2025 Puget Sound Human Factors and Ergonomics Society (PSHFES) Symposium is on May 29, 2025, from 8:00 AM to 3:00 PM at the University of Washington’s Center for Urban Horticulture, Seattle. This hybrid event includes both in-person and virtual attendance. Key speakers include Dr. Andrew Thatcher and Dr. Camille Peres. Topics cover workplace ergonomics, wearable tech, and human-machine interaction. Emerging research from the University of Washington will also be highlighted. Early bird registration ends May 15. Recordings will be available to registered attendees.",
        "link": "https://www.pshfes.org/symposium2025"
    },
	{
        "image": "./img/safety-and-health-magazine-logo.png",
        "category": "Research",
        "title": "Qigong may help relieve chronic low back pain, study of military vets shows",
        "source": "Safety & Health Magazine",
        "date": "February 21, 2025",
        "summary": "A study by Florida Atlantic University found that qigong significantly reduced pain intensity, disability, and sleep disturbances in veterans with chronic low back pain. Over eight weeks, veterans practicing qigong experienced greater improvements compared to a control group. Researchers also linked an inflammatory marker to pain-related disability and PTSD, which can worsen veterans’ health challenges. Qigong may enhance musculoskeletal strength, flexibility, posture, and mental well-being, helping veterans manage chronic pain.",
        "link": "https://www.safetyandhealthmagazine.com/articles/26525-qigong-may-help-relieve-chronic-low-back-pain-study-of-military-vets-shows"		
    },
	{
        "image": "./img/hfes-logo.png",
        "category": "Research",
        "title": "FPE 2025-2026 Impact Grants",
        "source": "Human Factors and Ergonomics Society",
        "date": "February 17, 2025",
        "summary": "The Foundation for Professional Ergonomics (FPE) is offering Impact Grants for 2025-2026 to support small projects that advance professional ergonomics, especially in developing countries. Grants range from $500 to $2,000 and serve as seed funding for pilot projects. The application deadline is April 30, 2025, with award decisions announced by August 15, 2025.",
        "link": "https://www.hfes.org/About/Latest-News/fpe-2025-2026-impact-grants"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Legal",
        "title": "Trump to Nominate David Keeling as OSHA Administrator",
        "source": "Occupational Health & Safety",
        "date": "February 14, 2025",
        "summary": "President Donald Trump has nominated David Keeling to be the next administrator of the Occupational Safety and Health Administration (OSHA). In a LinkedIn post, Keeling expressed gratitude for the nomination and enthusiasm for the opportunity to enhance workplace safety and health if confirmed. The nomination was announced to the Senate on February 12, 2025. Keeling has previously held leadership roles in global safety at Amazon and UPS.",
        "link": "https://ohsonline.com/Articles/2025/02/14/White-House-Nominates-Keeting-to-Head-OSHA.aspx"
    },
		{
        "image": "./img/ehs-today-logo.png",
        "category": "Industry",
        "title": "Poultry, Swine Plants Need to Reduce Injuries Says Secretary Su",
        "source": "EHS Today",
        "date": "January 14, 2025",
        "summary": "A USDA report revealed that 81% of poultry processing workers are at increased risk of musculoskeletal disorders, prompting Acting Secretary of Labor Julie Su to emphasize the need for better worker safety measures. The study, part of the Poultry Processing Line Speed Evaluation Study (PULSE), found that injuries often go unreported and can be mitigated by increasing staffing and implementing effective ergonomic plans. Key findings indicated that workers at higher piece rates and evisceration line speeds experienced similar musculoskeletal disorder risks, and 40% reported moderate to severe work-related pain. Additionally, airborne peracetic acid levels exceeded safety limits in one in five jobs sampled across establishments. Read full report here: https://www.fsis.usda.gov/sites/default/files/media_file/documents/PULSE_PoultryStudy_250109_Final.pdf",
        "link": "https://www.ehstoday.com/safety/news/55260587/poultry-swine-plants-need-to-reduce-injuries-says-secretary-su"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Industry",
        "title": "Managing Extended and Unusual Work Shifts",
        "source": "Occupational Health & Safety",
        "date": "February 07, 2025",
        "summary": "Extended and unusual work schedules are increasingly common in high-demand fields like emergency response but can pose significant risks to worker health, safety, and productivity. These schedules can lead to fatigue, sleep disruption, and increased susceptibility to errors or accidents, with adjustment to night shifts often taking up to 10 days. Employers are encouraged to limit extended shifts, ensure adequate rest and recovery time, and recognize signs of fatigue among workers. By prioritizing health and safety, employers can maintain productivity while mitigating the negative effects associated with prolonged work hours.",
        "link": "https://ohsonline.com/Articles/2025/02/07/Managing-Extended-and-Unusual-Work-Shifts.aspx"
    },
		{
        "image": "./img/iea-logo.png",
        "category": "Events",
        "title": "FRAM, STAMP, and EAST: case study of a collaborative robot",
        "source": "International Ergonomics Society",
        "date": "February 05, 2025",
        "summary": "This webinar is the second part of a series on systemic methods in complex and digitalized manufacturing, focusing on applied and analytical modeling using FRAM and STAMP-STPA. It introduces systems-thinking approaches to analyze cobot safety from a socio-technical perspective, addressing human-machine interactions in increasingly complex applications. The webinar presents and tests three safety analysis methods—STAMP, FRAM, and EAST—through a demonstrator case study. These methods highlight the importance of understanding distributed and emergent results from joint actions, moving beyond a reductionist view of individual failures or single-agent responsibilities.",
        "link": "https://iea.cc/event/fram-stamp-and-east-case-study-of-a-collaborative-robot/"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Legal",
        "title": "Arizona Representative Introduces Bill to Abolish OSHA",
        "source": "Occupational Health & Safety",
        "date": "February 04, 2025",
        "summary": "U.S. Representative Andy Biggs of Arizona has introduced the 'Nullify Occupational Safety and Health Administration Act' (NOSHA Act), aiming to abolish OSHA by repealing the Occupational Safety and Health Act of 1970. The bill has been referred to the Committee on Education and Workforce for review. Biggs argues that workplace safety should be managed by state governments and private employers, claiming that OSHA's regulations are excessive. Supporters believe the federal government should reduce its involvement in safety regulations, while critics warn that dismantling OSHA could weaken worker protections.",
        "link": "https://ohsonline.com/Articles/2025/02/04/AZ-Rep-Introduces-Bill-to-Abolish-OSHA.aspx?admgarea=news"
    },
		{
        "image": "./img/modern-materials-handling-logo.png",
        "category": "Industry",
        "title": "Using tech to prioritize employee safety",
        "source": "Modern Materials Handling",
        "date": "February 03, 2025",
        "summary": "Canadian Tire implemented German Bionic's Apogee exoskeletons in its 75,000-square-foot warehouse to reduce lower back injuries and enhance worker safety. These powered suits provide up to 66 pounds of weight compensation per lift, easing the strain of physically demanding tasks like lifting and unloading goods. Employees report reduced fatigue and improved efficiency, contributing to faster order fulfillment and safer work practices. The exoskeletons also offer hybrid automation, AI-based learning, and real-time data tracking, supporting Canadian Tire’s workplace safety goals.",
        "link": "https://www.mmh.com/article/using_tech_to_prioritize_employee_safety/ergonomics"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Industry",
        "title": "Encouraging Workers to Embrace Ergonomic Work Strategies",
        "source": "Occupational Health & Safety",
        "date": "January 31, 2025",
        "summary": "To effectively communicate and encourage less experienced workers to use ergonomic work strategies, supervisors should engage in hands-on training that demonstrates the strategies and their benefits, allowing workers to practice and receive feedback. Traditional training often falls short due to its generic nature and lack of practical application, so it's important to use adult learning principles and focus on skill transfer. Short, focused microlearning sessions can enhance retention and application of ergonomic strategies in the workplace. Additionally, measuring the impact of the training through injury statistics and worker surveys can help ensure its effectiveness and justify the investment in developing solid ergonomic practices.",
        "link": "https://ohsonline.com/Articles/2025/01/31/Encouraging-Workers-to-Embrace-Ergonomic-Work-Strategies.aspx"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Industry",
        "title": "How to Find the Most Ergonomic Way to Do a Job",
        "source": "Occupational Health & Safety",
        "date": "January 30, 2025",
        "summary": "Ergonomics aims to fit work to people, minimizing the risk of musculoskeletal disorders and enhancing performance. Effective ergonomic strategies can be identified by consulting experienced workers, those who have recovered from injuries, and smaller workers who have developed unique techniques for completing tasks. While these strategies can help reduce injury risks, they are not a substitute for necessary engineering controls to fix the root causes of workplace hazards. Organizations should document and share these strategies through visual aids and training to promote safe practices among all employees.",
        "link": "https://ohsonline.com/Articles/2025/01/30/How-to-Find-the-Most-Ergonomic-Way-to-Do-a-Job.aspx"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Legal",
        "title": "DOL Halts All Activity Tied to Executive Order 11246",
        "source": "Occupational Health & Safety",
        "date": "January 27, 2025",
        "summary": "The U.S. Department of Labor has halted all investigative and enforcement actions related to the rescinded Executive Order 11246. Acting Secretary of Labor Vince Micone issued Secretary’s Order 03-2025, instructing department employees to stop these activities immediately. This directive impacts all employees, including those in the Office of Federal Contract Compliance Programs, the Office of Administrative Law Judges, and the Administrative Review Board.",
        "link": "https://ohsonline.com/Articles/2025/01/27/DOL-Halts-All-Activity-Tied-to-Executive-Order-11246.aspx?admgarea=news"
    },
		{
        "image": "./img/iea-logo.png",
        "category": "Events",
        "title": "Using STAMP-STPA in a real case of complex manual assembly in aircraft engine manufacturing",
        "source": "International Ergonomics Society",
        "date": "January 25, 2025",
        "summary": "The first part of the webinar series, hosted by the IEA Resilience Engineering Committee, focuses on applying systemic methods like FRAM and STAMP-STPA in complex and digitalized manufacturing environments. The session highlights a year-long project in an aerospace manufacturing facility, showcasing how these methods can enhance quality and safety by analyzing the entire sociotechnical ecosystem. The discussion emphasizes how AcciMap and STAMP can identify control failures and improve processes through a comprehensive understanding of complex systems. Participants are encouraged to reflect on how these methodologies contribute to resilient, efficient, and continuously improving manufacturing practices.",
        "link": "https://iea.cc/event/using-stamp-stpa-in-a-real-case-of-complex-manual-assembly-in-aircraft-engine-manufacturing/"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Events",
        "title": "ASSP Opens Registration for Safety 2025 Conference and Expo",
        "source": "Occupational Health & Safety",
        "date": "January 21, 2025",
        "summary": "Safety 2025 will feature over 200 educational sessions aimed at providing practical strategies for enhancing workplace safety. The event, described by ASSP President Pam Walaski as a dynamic learning and networking opportunity, will showcase more than 600 exhibitors and allow participants to earn up to 1.5 continuing education units (CEUs). An interactive Career Advancement Center will also be available for professionals at all career stages. Early registration discounts are available until March 13, with additional savings for groups and an expo-only pass option for attendees focused on the exhibit floor.",
        "link": "https://ohsonline.com/Articles/2025/01/21/ASSP-Opens-Registration-for-Safety-2025-Conference-and-Expo.aspx?admgarea=news"
    },
		{
        "image": "./img/safety-and-health-magazine-logo.png",
        "category": "Industry",
        "title": "Nomination period open: 2025 Prevention through Design Award",
        "source": "Safety & Health Magazine",
        "date": "January 17, 2025",
        "summary": "NIOSH is accepting nominations for its Prevention through Design Award until March 3, recognizing efforts to reduce workplace hazards during the design phase of projects. The award honors individuals, teams, and organizations that have effectively eliminated or reduced risks through design improvements or contributions to knowledge on PtD solutions. Applicants are encouraged to address specific questions related to problem-solving, design improvements, health and safety benefits, and risk assessment in their nominations. Submissions can be sent via email to ptd@cdc.gov with 'PtD Award Nomination' in the subject line.",
        "link": "https://www.safetyandhealthmagazine.com/articles/26378-nomination-period-open-2025-prevention-through-design-award"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Legal",
        "title": "OSHA Adjusts Penalty Amounts for Safety Violations for 2025",
        "source": "Occupational Health & Safety",
        "date": "January 15, 2025",
        "summary": "Effective January 15, 2025, OSHA penalties will increase due to an annual inflation adjustment mandated by federal law. Maximum fines for serious and other-than-serious violations will rise to $16,550 per violation, while willful or repeated violations will increase to $165,514. These adjustments follow the Federal Civil Penalties Inflation Adjustment Act to maintain deterrence. The DOL urges employers to comply with OSHA regulations to ensure workplace safety and avoid costly fines.",
        "link": "https://ohsonline.com/Articles/2025/01/15/OSHA-Adjusts-Penalty-Amounts-for-Safety-Violations-for-2025.aspx?admgarea=news"
    },
		{
        "image": "./img/safety-and-health-magazine-logo.png",
        "category": "Industry",
        "title": "Wearables in the workplace: EEOC highlights risks and challenges",
        "source": "Safety & Health Magazine",
        "date": "January 14, 2025",
        "summary": "The Equal Employment Opportunity Commission (EEOC) has issued a reminder to employers that employment discrimination laws apply to the use of data collected from wearable devices in the workplace. This includes smart watches, sensors, smart glasses, and other technology that monitors employee health and safety. Employers must ensure they do not conduct unlawful disability-related inquiries under the Americans with Disabilities Act and must comply with nondiscrimination laws when using wearable data for employment decisions. The EEOC emphasizes that there is no exemption from civil rights laws for high-tech workplace practices, urging employers to carefully manage data collection, storage, and usage.",
        "link": "https://www.safetyandhealthmagazine.com/articles/26323-wearables-in-the-workplace-eeoc-highlights-risks-and-challenges"
    },
		{
        "image": "./img/wjtv-12-news-logo.png",
        "category": "Industry",
        "title": "VelocityEHS Named a Leader for EHS Software for the Sixth Time",
        "source": "WJTV 12 News",
        "date": "January 09, 2025",
        "summary": "VelocityEHS has been named a Leader in the 2025 Verdantix Green Quadrant for EHS Software, marking its sixth recognition for innovation in AI-driven ergonomics, safety solutions, and platform architecture. The company's Accelerate Platform features user-friendly tools, centralized risk management, and advanced reporting capabilities. Notably, VelocityEHS achieved perfect scores in ergonomics, driven by its motion-capture AI innovations, and leads in categories such as chemicals management and safety. Recognized globally, VelocityEHS supports over 10 million users with comprehensive EHS and ESG solutions.",
        "link": "https://www.wjtv.com/business/press-releases/globenewswire/9329390/velocityehs-named-a-leader-for-ehs-software-for-the-sixth-time/"
    },
		{
        "image": "./img/modern-materials-handling-logo.png",
        "category": "Industry",
        "title": "Ergonomics: Time to revisit wearables",
        "source": "Modern Materials Handling",
        "date": "January 08, 2025",
        "summary": "Wearable technology in warehouses, including exoskeletal suits and IT-driven devices like scanners, RFID gloves, and AI-powered analytics, is enhancing productivity, accuracy, and worker safety. Companies like DHL, BR Williams, and HeroWear report significant efficiency gains, reduced fatigue, and fewer injuries with these innovations. AI-driven software and RFID advancements are further optimizing workflows, enabling real-time decision-making and seamless data integration. As adoption grows, wearables are reshaping warehouse operations by improving efficiency, reducing errors, and enhancing worker well-being.",
        "link": "https://www.mmh.com/article/time_to_revisit_wearables/ergonomics"
    },
		{
        "image": "./img/handpak-logo.png",
        "category": "Research",
        "title": "HandPak 20th Anniversary",
        "source": "LinkedIn - Jim Potvin",
        "date": "January 07, 2025",
        "summary": "On January 7, 2025, the 20th anniversary of the HandPak software package was celebrated, marking its impact since its release in 2005 and the launch of its web-based version in 2016. HandPak, a tool for quantitative ergonomics analyses of hand, wrist, and forearm-intensive tasks, integrates findings from numerous scientific publications. Used by nearly 100 organizations and freely provided to over 20 universities, it has played a key role in advancing ergonomic research and practice",
        "link": "https://www.linkedin.com/posts/jim-potvin-ab47a8b_today-i-am-celebrating-the-20th-anniversary-activity-7282385260837851136-tMYB"
    },
		{
        "image": "./img/ohs-logo.png",
        "category": "Legal",
        "title": "Washington L&I Launches Ergonomics Rulemaking for High-Risk Workers",
        "source": "Occupational Health & Safety",
        "date": "January 02, 2025",
        "summary": "The Washington State Department of Labor & Industries (L&I) is developing ergonomics rules to reduce work-related musculoskeletal disorders (WMSDs) in high-risk industries, starting with Scheduled Airlines - Ground Crew Operations. A virtual scoping meeting on January 9, 2025, will gather stakeholder input on WMSD hazards and rule priorities, with written feedback accepted until January 27, 2025. This follows a 2023 mandate allowing L&I to regulate industries with high worker injury rates, with only one rule permitted per year. L&I emphasizes stakeholder involvement to create effective, industry-specific regulations.",
        "link": "https://ohsonline.com/Articles/2025/01/02/Washington-L-and-I-Launches-Ergonomics-Rulemaking-for-High-Risk-Workers.aspx?admgarea=news"
    },
		{
        "image": "./img/safety-and-health-magazine-logo.png",
        "category": "Industry",
        "title": "'Unfavorable working conditions' pave the way to trucker MSDs: study",
        "source": "Safety & Health Magazine",
        "date": "December 30, 2024",
        "summary": "A study by Kerman University of Medical Sciences found that 61.8% of truck drivers suffer from musculoskeletal disorders (MSDs), with the shoulder, neck, lower back, and knees most commonly affected. Risk factors include prolonged static and awkward postures, whole-body vibration, and load handling. MSDs, such as tendinitis and back strains, are the leading workplace injury and a major cause of disability, according to the National Safety Council. Researchers recommend training programs, ergonomic interventions, and regular work environment assessments to reduce MSD prevalence among truck drivers.",
        "link": "https://www.safetyandhealthmagazine.com/articles/26301-unfavorable-working-conditions-pave-the-way-to-trucker-msds-study"
    },
		{
        "image": "./img/rmcoeh-logo.png",
        "category": "Research",
        "title": "Who’s Behind the Wheel?",
        "source": "LinkedIn - The Rocky Mountain Center for Occupational and Environmental Health (RMCOEH)",
        "date": "December 25, 2024",
        "summary": "A recent study conducted at the Rocky Mountain Center for Occupational and Environmental Health (RMCOEH) analyzed 293 new bus operators, who were on average 42.76 years old, mostly male (73.5%), and included a significant proportion from minority backgrounds (45.7%). Notably, two-thirds (66.3%) had no prior experience in commercial driving, with most coming from roles in transportation, protective services, or sales. Health risk levels were classified as low (49.5%), medium (37.9%), and high (12.6%), with risks including potential ergonomic issues, chronic conditions, and lifestyle factors such as obesity and physical inactivity. This data highlights the need for transit authorities to address health risks and support operators’ transition to their roles.",
        "link": "https://www.linkedin.com/posts/rmcoeh_publictransportation-transitworkers-occupationalhealthactivity-7275276247276908545-VwPA"
    },
		{
        "image": "./img/nsc-logo.png",
        "category": "Industry",
        "title": "NSC MSD Solutions Index Reveals Workplace Safety Progress",
        "source": "National Safety Council",
        "date": "December 23, 2024",
        "summary": "The National Safety Council’s 2023-2024 MSD Solutions Index Pledge Community Report highlights progress in reducing workplace musculoskeletal disorders (MSDs) through increased ergonomics programs, proactive prevention measures, and industry collaboration. The survey found that 81.4% of organizations are advancing or proactive in MSD prevention, with 11.6% reaching the innovating category—an improvement from the previous year. Key findings include greater employee involvement in safety decisions, increased focus on leading indicators, and expanded sharing of MSD prevention solutions. The report recommends strengthening safety culture, prioritizing worker feedback, setting measurable risk reduction goals, and leveraging new technologies.",
        "link": "https://www.nsc.org/newsroom/nsc-msd-solutions-index-reveals-workplace-safety-p"
    },
		{
        "image": "./img/hfes-logo.png",
        "category": "Events",
        "title": "Informal Work and Ergonomics: Experiences from Chile and Ecuador",
        "source": "Human Factors and Ergonomics Society",
        "date": "December 19, 2024",
        "summary": "The IEA Informal Work Technical Committee is hosting a free webinar on January 29, 2025, at 16:00 UTC, focusing on informal work and ergonomics in Chile and Ecuador. Organized with Universidad de Atacama and Pontificia Universidad Católica del Ecuador, it will explore human factors methodologies in diagnosing and transforming informal work. The 90-minute webinar will be in Spanish with simultaneous English translation, and registration is free but required. Attendees can complete a post-webinar survey to receive an e-certificate of completion.",
        "link": "https://www.hfes.org/About/Latest-News/informal-work-and-ergonomics-experiences-from-chile-and-ecuador"
    },
		{
        "image": "./img/department-of-labor-logo.png",
        "category": "Legal",
        "title": "US Department of Labor announces settlement with Amazon requiring corporate-wide ergonomic measures at facilities across the country",
        "source": "U.S. Department of Labor",
        "date": "December 19, 2024",
        "summary": "The U.S. Department of Labor announced a settlement with Amazon to improve ergonomic safety and address hazardous conditions across its facilities. Amazon will implement risk assessments, site-specific controls, and employee training while OSHA monitors compliance. The agreement includes a $145,000 penalty and biannual progress reviews. It does not affect an ongoing investigation into alleged concealment of injury rates.",
        "link": "http://www.dol.gov/newsroom/releases/osha/osha20241219"
    },
		{
        "image": "./img/canadian-occupational-safety-logo.png",
        "category": "Legal",
        "title": "Ontario’s $500,000 safety fine will reduce workplace injuries and fatalities, says expert",
        "source": "Canadian Occupational Safety",
        "date": "December 19, 2024",
        "summary": "Ontario plans a $500,000 minimum fine for employers responsible for multiple workplace injuries or deaths, aiming to curb rising incidents. Research by Dr. Emile Tompa shows penalties reduce injuries, unlike inspections without penalties. Part of the Working for Workers Act, the fine would be Canada’s highest and aims to improve compliance. Tompa stresses proactive measures and tailored enforcement for workplace safety.",
        "link": "https://www.thesafetymag.com/ca/news/general/ontarios-500000-safety-fine-will-reduce-workplace-injuries-and-fatalities-says-expert/518743"
    },
		{
        "image": "./img/hfes-logo.png",
        "category": "Research",
        "title": "Submit Your Application for the 2025 Fellows Program",
        "source": "Human Factors and Ergonomics Society",
        "date": "December 18, 2024",
        "summary": "The HFES Fellows Selection Committee invites applications for the 2025 HFES Fellow designation, recognizing outstanding professional achievements and contributions. Members may apply for themselves or nominate others. Applications are due by February 28, 2025. More details are available at the HFES Fellows Program website.",
        "link": "https://www.hfes.org/About/Latest-News/submit-your-application-for-the-2025-fellows-program"
    },
		{
        "image": "./img/safety-and-health-magazine-logo.png",
        "category": "Research",
        "title": "'Strength breaks' at work may offset the effects of too much sitting",
        "source": "Safety & Health Magazine",
        "date": "December 11, 2024",
        "summary": "Ashley Gluchowski, a clinical exercise physiologist at the University of Salford, recommends integrating strength training into the workplace to counteract the effects of sedentary desk jobs. Her eight-week program includes bodyweight exercises like squats and lunges in the first two weeks, progressing to kettlebells or dumbbells for added resistance in later weeks. This approach not only builds strength but also improves sleep, mood, and immunity.",
        "link": "https://www.safetyandhealthmagazine.com/articles/26239-strength-breaks-at-work-may-offset-the-effects-of-too-much-sitting"
    },
		{
        "image": "./img/nsc-logo.png",
        "category": "Research",
        "title": "NSC Commits Another $300,000 in Grants to Solve Most Common Workplace Injury",
        "source": "National Safety Council",
        "date": "December 09, 2024",
        "summary": "The National Safety Council (NSC) has announced the return of its Research to Solutions (R2S) and MSD Solutions Pilot Grant programs, awarding up to $300,000 to advance musculoskeletal disorder (MSD) prevention. The R2S grant offers up to $50,000 per project for research on MSD risk reduction, while the Pilot Grant provides up to $20,000 per project to trial emerging technologies in real-world applications. Winners will be announced in June 2025, with findings presented at the 2026 NSC Safety Congress & Expo. These grants are part of NSC’s MSD Solutions Lab, which aims to develop scalable MSD prevention solutions.",
        "link": "https://www.nsc.org/newsroom/nsc-commits-another-$300,000-in-grants-to-solve-mo"
    },
		{
        "image": "./img/niosh-logo.png",
        "category": "Industry",
        "title": "How to Use the New NLE Calc App Features to Help Prevent Back Injuries",
        "source": "NIOSH Science Blog",
        "date": "December 04, 2024",
        "summary": "Back injuries are a leading cause of work-related musculoskeletal disorders, accounting for 40% of cases requiring time off work. Repetitive heavy lifting or improper lifting posture are major contributors to these injuries. In response, NIOSH introduced the NIOSH Lifting Equation (NLE) Calc app in 2017 to help assess lifting risks and prevent injuries by calculating the Recommended Weight Limit (RWL) and Lifting Index (LI). The app was updated in September 2024, with new features designed to improve usability and efficiency, incorporating feedback from users to enhance its effectiveness in reducing workplace lifting risks.",
        "link": "https://blogs.cdc.gov/niosh-science-blog/2024/12/04/nle-calc-2024/"
    }
]
